In [20]:
# Team Members
# Joed Quaye 
# Ronald Chomnou 
# Griffin Araujo

# Part 1: Wrangling
# compute a relation containing the total payroll and winning percentage for each team

import sqlite3
import pandas 
import numpy

# creating Connection object that represents the database
connection = sqlite3.connect('lahman2014.sqlite')

# create cursor object to perform SQL commands
c = connection.cursor()

# tabulating payroll for each year 
salary_query = "SELECT yearID, teamID, sum(salary) as total_payroll FROM Salaries WHERE lgID == 'AL' GROUP BY yearID, teamID"

# Read SQL query or database table into a DataFrame.
team_salaries = pandas.read_sql(salary_query, connection)

team_query = """
    SELECT 
        teamID,
        yearID,
        sum(W) as total_wins,
        sum(G) as total_games,
        CAST(sum(W) AS FLOAT) * 100.0 / CAST(sum(G) AS FLOAT) as winning_percentage
    FROM Teams
    GROUP BY teamID, yearID
"""

# mean_query = "SELECT yearID, sum(salary)/count(salary) as salary_mean FROM Salaries GROUP BY yearID"

team_table = pandas.read_sql(team_query, connection)
# mean_table = pandas.read_sql(mean_query, connection)

# the team salaries

result = pandas.merge(team_salaries, team_table, how='outer', on=['yearID', 'teamID'])
# result = result = pandas.merge(result, mean_table, how='outer', on=['yearID'])

# this is the table
result 


# with the missing data, we just ignored it because we used inner join after obtaining the data from the SQL query 
# (that's why some of the data shows up as NaN)

,yearID,teamID,total_payroll,total_wins,total_games,winning_percentage
0,1871,BS1,NaN,20,31,64.516129
1,1871,CH1,NaN,19,28,67.857143
2,1871,CL1,NaN,10,29,34.482759
3,1871,FW1,NaN,7,19,36.842105
4,1871,NY2,NaN,16,33,48.484848
...,...,...,...,...,...,...
2770,2014,SLN,NaN,90,162,55.555556
2771,2014,TBA,72689100.0,77,162,47.530864
2772,2014,TEX,112255059.0,67,162,41.358025
2773,2014,TOR,109920100.0,83,162,51.234568
2774,2014,WAS,NaN,96,162,59.259259

In [ ]:
pip install pandas

In [ ]:
# Part 2: Exploratory Data Analysis